README.md

# Table of Contents

1.  [Nome do Software (ou Biblioteca):](#orgc002d94)
2.  [Resumo e/ou informação extra:](#org4bf6e7d)
3.  [Versão:](#org331271d)
4.  [Data:](#org7b70193)
5.  [Autor de Contato:](#org5f09525)
6.  [Lista dos Autores:](#org119a6e9)
7.  [Áreas de pesquisa vinculadas:](#orgb8506a6)
8.  [Vinculo com:](#orgc08a5e8)
9.  [Paradigmas:](#orga08f67d)
10. [Tipo de Interface:](#orgf2988f8)
11. [Plataformas Suportadas:](#orgd0bdea2)
12. [Linguagens Utilizadas:](#org9ab9689)
13. [Bibliotecas Utilizadas (dependências):](#orge4e7b91)
14. [Softwares utilizados (dependências)](#org2fe1085)
15. [Tipo de Licença:](#org32ec564)
16. [Links:](#org2e7f380)


<a id="orgc002d94"></a>

# Nome do Software (ou Biblioteca):

-   ESPPERFORMANCE - SIMULADOR DE CURVAS DE DESEMPENHO DE BCS: HEAD E PERDAS DE CARGA


<a id="org4bf6e7d"></a>

# Resumo e/ou informação extra:

-   Desenvolver um simulador que calcule as curvas de perfomance de operação

de BCS utilizado em elevação artficial de petróleo a partir de parametrizações
para escoamento defluidos em bombas centrífugas.


<a id="org331271d"></a>

# Versão:

-   1.0.


<a id="org7b70193"></a>

# Data:

-   2016/2 - segundo semestre.


<a id="org5f09525"></a>

# Autor de Contato:

-   André Duarte Bueno <andreduartebueno@gmail.com>


<a id="org119a6e9"></a>

# Lista dos Autores:

-   Fernando Henrique Moreira Braga Fernandes
-   Maria Beatriz Lisboa Pereira
-   André Duarte Bueno <andreduartebueno@gmail.com>


<a id="orgb8506a6"></a>

# Áreas de pesquisa vinculadas:

-   Modelagem Matemática Computacional
-   Elevação e Escoamento


<a id="orgc08a5e8"></a>

# Vinculo com:

-   Trabalho da disciplina de programação prática.


<a id="orga08f67d"></a>

# Paradigmas:

-   POO - Programação Orientada a Objeto (códigos em C++)


<a id="orgf2988f8"></a>

# Tipo de Interface:

-   Terminal e gráfica (gnuplot).


<a id="orgd0bdea2"></a>

# Plataformas Suportadas:

-   Windows e GNU/Linux e Mac OS X (não testada).


<a id="org9ab9689"></a>

# Linguagens Utilizadas:

-   C++ 11.


<a id="orge4e7b91"></a>

# Bibliotecas Utilizadas (dependências):

-   CGnuplot - <https://github.com/ldsc/CGnuplot>


<a id="org2fe1085"></a>

# Softwares utilizados (dependências)

-   gnuplot <http://www.gnuplot.info/>


<a id="org32ec564"></a>

# Tipo de Licença:

-   GPL
-   Entre em contato com o Prof. André Duarte Bueno
    andreduartebueno@gmail.com
    para que o mesmo gere um novo projeto no github do ldsc para que você (e sua equipe) possam trabalhar na nova versão.
-   Se este projeto tem como número de versão 1.0 a nova versão deverá ser 2.0 e assim sucessivamente.
-   Os nomes dos autores originais deve ser preservada na nova versão, ou seja, adicione a informação do número da versão, os nomes dos membros da nova equipe, mas jamais apague os nomes dos autores originais (isto seria plágio).
-   Na descrição do projeto informe que trata-se de uma nova versão, que tem como base a versão anterior e DESTAQUE COM CLAREZA E OBJETIVIDADE QUAIS AS NOVIDADES DA NOVA VERSÃO.


<a id="org2e7f380"></a>

# Links:

